Repository: laythm/LMYFrameWorkMVC
Catalog: Common/Resources/Resources.*.resx
Languages: ar

# ValidateNumber
source: {0} must be a number.
ar: {0} يجب ان يكون رقم

# ValidationInvalidEmail
source: The {0} field is not a valid e-mail address.
ar: {0} صيغة بريد إلكتروني خاطئة

# ValidationMinimumLength
source: The {0} must be at least {1} characters long.
ar: {0} يجب أن تكون {1} أحرف على الأقل.

# ValidationNotMatch
source: The new password and confirmation password do not match.
ar: عدم تطابق في كلمتي المرور.

# ValidationNumber
source: {0} must be numbers only
ar: {0} يجب ان تكون ارقام فقط

# ValidationRequired
source: {0} is required.
ar: {0} إجباري.

source: Value
ar: القيمة

# ValidationRegEx
source: {0} must be valid
ar: يجب ان تكون قيمة صحيحة {0}

source: Email
ar: البريد الالكتروني

source: English Name
ar: الاسم - الانجليزي

source: Key
ar: المفتاح

source: Name
ar: الاسم

source: Password
ar: كلمة المرور

source: Permisions
ar: الصلاحيات

source: Phone Number
ar: رقم الهاتف

source: Remember me
ar: تذكرني

source: User
ar: المستخدم

source: User Name
ar: اسم المستخدم

source: Arabic Name
ar: الاسم - العربي

source: Roles
ar: الصلاحيات

# ValidationAllowedFileTypes
source: the {0} file type must be one of the following ({1})
ar: صيغة ملف {0} غير مسموح بها يجب ان يكون نوع الملف كالتالي({1})

# ValidationMaxFileSize
source: the {0} file size exceeds the allowed size must be less than ({1} bytes)
ar: حجم الملف {0} كبيرة يجب انت تكون اقل من ({1} bytes)

# FromUser
source: From
ar: من

source: Message
ar: الرسالة

# ToUser
source: To
ar: الى

source: Message text
ar: الرسالة

source: To users
ar: الى المستخدمين

source: Role
ar: المجموعة

# ValidationMaxLength
source: The {0} character number must be less than {1}.
ar: {0} يجب أن يكون عدد أحرف {1} أكبر من.

# ValidationDate
source: The {0} must be a date
ar: يجب ان يكون {0} تاريخ صحيح

# EmailExists
source: Email already exists
ar: البريد الالكتروني مدخل مسبقا

# EnterMessage
source: Please enter message
ar: يجب ادخال الرسالة

source: Login first to complete operation
ar: قم بتسجيل الدخول لاتمام العملية

source: Message Sent
ar: تم ارسال الرسالة بنجاح

# NameExists
source: Name already exists
ar: الاسم موجود مسبقا

source: No
ar: لا

source: Not found
ar: غير موجود

# PhoneNumberExists
source: Phone number already exists
ar: رقم الهاتف مدخل مسبقا

# RefrenceDeleteError
source: This record could not be deleted because there are records related to it
ar: لا يمكن حذف هذا الحقل لان هناك بيانات اخرى متعلقة به

source: Role added successfully
ar: تم اضافة المجموعة بنجاح

source: Role deleted successfully
ar: تم حذف المجموعة بنجاح

source: Role updated successfully
ar: تم تعديل المجموعة بنجاح

source: Setting updated successfully
ar: تم تعديل الاعداد بنجاح

# ThisIsNotDeletAble
source: this entity is not deletable because it is part of the system
ar: لايمكن حذف هذا السجل لانه جزء من النظام

# ThisIsTheLastRecord
source: You can not delete the last record
ar: لايمكن الحذف لانه لا يوجد غيره

source: User added successfully
ar: تم اضافة المستخدم بنجاح

source: User deleted successfully
ar: تم حذف المستخدم بنجاح

# UserNameExists
source: User name already exists
ar: اسم المستخدم مدخل مسبقا

# UserPasswordChangedSuccessfully
source: Password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: User updated successfully
ar: تم تعديل المستخدم بنجاح

source: Wrong username or password
ar: هناك خطأ في اسم الدخول او كلمة المرور

source: Yes
ar: نعم

source: At date
ar: في تاريخ

source: Company
ar: الشركة

source: Contact number
ar: رقم الاتصال

source: Driver
ar: السائق

source: Driver per mile cost
ar: سعر السائق لكل ميل

source: Expense type
ar: نوع المصاريف

source: From date
ar: من تاريخ

source: From notes
ar: من - ملاحظات

source: From state
ar: من ولاية

source: Fuel cost
ar: تكلفة الوقود

source: Milage
ar: الاميال

source: Notes
ar: ملاحظات

source: On buy date
ar: تاريخ الشراء

source: On buy expenses
ar: مصاريف الشراء

source: On buy milage
ar: الاميال عند الشراء

source: On buy notes
ar: ملاحظات الشراء

source: On buy price
ar: سعر الشراء

source: Other costs
ar: التكاليف الاخرى

source: Other costs notes
ar: ملاحظات التكاليف الاخرى

source: Price
ar: السعر

source: Price per mile
ar: السعر لكل ميل

source: Start date
ar: تاريخ البداية

source: State code
ar: رمز الولاية

source: Status
ar: الحالة

source: To date
ar: الى تاريخ

source: To notes
ar: الى - ملاحظات

source: To state notes
ar: من ولاية - ملاحظات

source: Truck
ar: الشاحنة

source: To state
ar: الى ولاية

# AlreadyExists
source: {0} already exists
ar: {0} موجود مسبقا

source: Company added successfully
ar: تم اضافة الشركة بنجاح

source: Company deleted successfully
ar: تم حذف الشركة بنجاح

source: Company updated successfully
ar: تم تعديل الشركة بنجاح

source: Driver added successfully
ar: تم اضافة السائق بنجاح

source: Driver deleted successfully
ar: تم حذف السائق بنجاح

source: Driver updated successfully
ar: تم تعديل السائق بنجاح

# USAStateAddedSuccessfully
source: State added successfully
ar: تم اضافة الولاية بنجاح

# USAStateDeletedSuccessfully
source: State deleted successfully
ar: تم حذف الولاية بنجاح

# USAStateUpdatedSuccessfully
source: State updated successfully
ar: تم تعديل الولاية بنجاح

source: Total costs
ar: المصاريف الكليه

source: Total income
ar: العائدات الكليه

source: Total profit
ar: الربح الصافي الكلي

source: Duration is over lapped with other load
ar: المدة تتعارض مع مدة حمولة اخرى

source: Load added successfully
ar: تم اضافة الحمولة بنجاح

source: Load deleted successfully
ar: تم حذف الحمولة بنجاح

source: Load updated successfully
ar: تم تعديل الحمولة بنجاح

source: Truck added successfully
ar: تم اضافة الشاحنة بنجاح

source: Truck deleted successfully
ar: تم حذف الشاحنة بنجاح

source: Truck expense added successfully
ar: تم اضافة المصاريف بنجاح

source: Truck expense deleted successfully
ar: تم حذف المصاريف بنجاح

source: Truck expense updated successfully
ar: تم تعديل المصاريف بنجاح

source: Truck updated successfully
ar: تم تعديل الشاحنة بنجاح

# ValidationRange
source: The {0} must be from {1} to {2}
ar: يجب ان يكون {0} بين القيمة {1} و {2}

# ValidationPastDate
source: {0} must be in past only.
ar: يجب ان يكون {0} في الماضي فقط
